       IDENTIFICATION DIVISION.
       PROGRAM-ID. CreaArchivoEmpresasIndex.
       AUTHOR. Fede.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARCH-EMP-SEQ ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS FS-ARCH-EMP-SEQ.

           SELECT ARCH-EMP-IDX ASSIGN TO DISK
           ORGANIZATION IS INDEXED
           ACCESS MODE IS SEQUENTIAL
           RECORD KEY IS REG-EMP-IND-COD
           ALTERNATE RECORD KEY IS REG-EMP-IND-CUIT
           FILE STATUS IS FS-ARCH-EMP-IDX.

       DATA DIVISION.
       FILE SECTION.

       FD ARCH-EMP-SEQ
       VALUE OF FILE-ID IS 'EMPRESAS.DAT'
       DATA RECORD IS REG-EMP-SEC.

       01 REG-EMP-SEC.
       03 REG-EMP-COD           PIC 9(3).
       03 REG-EMP-RAZON         PIC X(25).
       03 REG-EMP-DIRECCION     PIC X(20).
       03 REG-EMP-TEL           PIC X(20).
       03 REG-EMP-CIUT          PIC 9(11).

       FD ARCH-EMP-IDX LABEL RECORD IS STANDARD
       VALUE OF FILE-ID IS 'EMPRESAS-INDEXED.DAT'
       DATA RECORD IS REG-EMP-INDEXED.

       01 REG-EMP-INDEXED.
       03 REG-EMP-IND-COD           PIC 9(3).
       03 REG-EMP-IND-RAZON         PIC X(25).
       03 REG-EMP-IND-DIRECCION     PIC X(20).
       03 REG-EMP-IND-TEL           PIC X(20).
       03 REG-EMP-IND-CUIT          PIC 9(11).

       WORKING-STORAGE SECTION.

       01 WS-LETRA   PIC X.
       01 WS-ACUM-REG PIC 9.

       77 FS-ARCH-EMP-SEQ PIC XX.
           88 SEQ-OK        VALUE '00'.
           88 SEQ-NOENC    VALUE '23'.
           88 SEQ-EOF    VALUE '10'.

       77 FS-ARCH-EMP-IDX    PIC XX.
           88 IDX-OK        VALUE '00'.
           88 IDX-NOENC    VALUE '23'.
           88 IDX-EOF    VALUE '10'.

       PROCEDURE DIVISION.

       CREAR-EMP-INDEXED.
           MOVE 0 TO WS-ACUM-REG.
           PERFORM ABRIR-ARCHIVOS.
           PERFORM LEER-SEQUENCIAL.
           PERFORM CARGAR-INDEXADO UNTIL SEQ-EOF.
           PERFORM TERMINAR.

       ABRIR-ARCHIVOS.
           OPEN OUTPUT ARCH-EMP-IDX.
           IF IDX-OK
       DISPLAY 'ARCHIVO IDX CREADO CON EXITO!'
           ELSE
       DISPLAY 'NO PUDO CREARSE ARCHIVO IDX ' FS-ARCH-EMP-IDX.
           OPEN INPUT ARCH-EMP-SEQ.
           IF SEQ-OK
       DISPLAY 'ARCHIVO SEQ ABIERTO CON EXITO!'
           ELSE
       DISPLAY 'NO PUDO ABRIRSE ARCHIVO SEQ ' FS-ARCH-EMP-SEQ.

       LEER-SEQUENCIAL.
           READ ARCH-EMP-SEQ.
           IF SEQ-OK
       DISPLAY 'OK. EMPRESA LEIDA: ' REG-EMP-COD
           ELSE
       DISPLAY 'NO PUDO LEER SEQ ' FS-ARCH-EMP-SEQ.

       CARGAR-INDEXADO.
           MOVE REG-EMP-SEC TO REG-EMP-INDEXED.
           WRITE REG-EMP-INDEXED.
           IF IDX-OK
       DISPLAY 'SE GRABO LA EMPRESA' REG-EMP-IND-COD
       ADD 1 TO WS-ACUM-REG
           ELSE
       DISPLAY 'ERROR DE ESCRITURA ' FS-ARCH-EMP-IDX.
           PERFORM LEER-SEQUENCIAL.


       TERMINAR.
           CLOSE ARCH-EMP-IDX.
           CLOSE ARCH-EMP-SEQ.
           DISPLAY 'SE ESCREIBIERON ' WS-ACUM-REG
           '  REGISTROS INDEXADOS'.
           DISPLAY 'INGRESE UN NRO PARA SALIR ' .
           ACCEPT WS-LETRA.
           STOP RUN.
