	IDENTIFICATION DIVISION.
	PROGRAM-ID. CreaArchivoConsIndex.
	AUTHOR. Fede.

	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	    SELECT ARCH-CONS-SEQ ASSIGN TO DISK
			ORGANIZATION IS LINE SEQUENTIAL
			FILE STATUS IS FS-ARCH-CONS-SEQ.
	
	    SELECT ARCH-CONS-INDEXED ASSIGN TO DISK
			ORGANIZATION IS INDEXED
			ACCESS MODE IS SEQUENTIAL
			RECORD KEY IS REG-KEY-CODE-CONS
			FILE STATUS IS FS-ARCH-CONS-INDEXED.

	DATA DIVISION.
	FILE SECTION.
	
	FD ARCH-CONS-SEQ LABEL RECORD IS STANDARD
             VALUE OF FILE-ID IS 'CONSULTORES.DAT'
             DATA RECORD IS REG-CONSULTORES-SEC.

   	01 REG-CONSULTORES-SEC.
       03 REG-CONS-NUMERO        PIC X(5).
       03 REG-CONS-DNI           PIC 9(8).
       03 REG-CONS-SRT           PIC X(2).
       03 REG-CONS-NOMBRE        PIC X(25).
       03 REG-CONS-DIRECCION     PIC X(20).
       03 REG-CONS-TELEFONO      PIC X(20).
	
	FD ARCH-CONS-INDEXED LABEL RECORD IS STANDARD
             VALUE OF FILE-ID IS 'CONSULTORES-INDEXED.DAT'
             DATA RECORD IS REG-CONSULTORES-INDEXED.

	01 REG-CONSULTORES-INDEXED.
       03 REG-KEY-CODE-CONS      PIC X(5).
       03 REG-CONS-DNI           PIC 9(8).
       03 REG-CONS-SRT           PIC X(2).
       03 REG-CONS-NOMBRE        PIC X(25).
       03 REG-CONS-DIRECCION     PIC X(20).
       03 REG-CONS-TELEFONO      PIC X(20).
	
	WORKING-STORAGE SECTION.

	01 WS-PADRON   PIC X.
	01 WS-ACUM-REG PIC 9.

	77 FS-ARCH-CONS-SEQ	PIC XX.
	    88 SEQ-OK		VALUE '00'.
	    88 SEQ-NOENC	VALUE '23'.
	    88 SEQ-EOF	VALUE '10'.

	77 FS-ARCH-CONS-INDEXED	PIC XX.
	    88 IDX-OK		VALUE '00'.
	    88 IDX-NOENC	VALUE '23'.
	    88 IDX-EOF	VALUE '10'.
	    
	PROCEDURE DIVISION.

	CREAR-CONSULTORES-INDEXED.
		MOVE 0 TO WS-ACUM-REG.
	    PERFORM ABRIR-ARCHIVOS.
	    PERFORM LEER-SEQUENCIAL.
	    PERFORM CARGAR-INDEXADO UNTIL SEQ-EOF.
	    PERFORM TERMINAR.

	ABRIR-ARCHIVOS.
	    OPEN OUTPUT ARCH-CONS-INDEXED.
	    IF IDX-OK
	       DISPLAY 'ARCHIVO IDX CREADO CON EXITO!'
	    ELSE
	       DISPLAY 'NO PUDO CREARSE ARCHIVO IDX ' FS-ARCH-CONS-INDEXED.
	    OPEN INPUT ARCH-CONS-SEQ.
	    IF SEQ-OK
	       DISPLAY 'ARCHIVO SEQ ABIERTO CON EXITO!'
	    ELSE
	       DISPLAY 'NO PUDO ABRIRSE ARCHIVO SEQ ' FS-ARCH-CONS-SEQ.

	LEER-SEQUENCIAL.
	    READ ARCH-CONS-SEQ.
	    IF SEQ-OK
	       DISPLAY 'OK. COD CONS LEIDO: ' REG-CONS-NUMERO
	    ELSE
	       DISPLAY 'NO PUDO LEER SEQ ' FS-ARCH-CONS-SEQ.

	CARGAR-INDEXADO.
	    MOVE REG-CONSULTORES-SEC TO REG-CONSULTORES-INDEXED.
	    WRITE REG-CONSULTORES-INDEXED.
	    IF IDX-OK
	       DISPLAY 'SE GRABO EL CONS ' REG-KEY-CODE-CONS
	       ADD 1 TO WS-ACUM-REG
	    ELSE
	       DISPLAY 'ERROR DE ESCRITURA ' FS-ARCH-CONS-INDEXED.
	    PERFORM LEER-SEQUENCIAL.

	
	TERMINAR.
	    CLOSE ARCH-CONS-INDEXED.
	    CLOSE ARCH-CONS-SEQ.
	    DISPLAY 'SE ESCREIBIERON ' WS-ACUM-REG 'REGISTROS INDEXADOS'.
	    DISPLAY 'INGRESE UN NRO PARA SALIR ' .
	    ACCEPT WS-PADRON.
	    STOP RUN.
