	IDENTIFICATION DIVISION.
	PROGRAM-ID. ProbarArchivoEmpresasIndex.
	AUTHOR. Fede.

	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	    SELECT ARCH-EMP-IDX ASSIGN TO DISK
			ORGANIZATION IS INDEXED
			ACCESS MODE IS RANDOM
			RECORD KEY IS REG-EMP-IND-COD
			ALTERNATE RECORD KEY IS REG-EMP-IND-CUIT
			FILE STATUS IS FS-ARCH-EMP-IDX.

	DATA DIVISION.
	FILE SECTION.
		
	FD ARCH-EMP-IDX LABEL RECORD IS STANDARD
             VALUE OF FILE-ID IS 'EMPRESAS-INDEXED.DAT'
             DATA RECORD IS REG-EMP-INDEXED.

	01 REG-EMP-INDEXED.
       03 REG-EMP-IND-COD           PIC 9(3).
       03 REG-EMP-IND-RAZON         PIC X(25).
       03 REG-EMP-IND-DIRECCION     PIC X(20).
       03 REG-EMP-IND-TEL           PIC X(20).
       03 REG-EMP-IND-CUIT          PIC 9(11).
	
	WORKING-STORAGE SECTION.

	01 WS-LETRA   PIC X.
	01 WS-ACUM-REG PIC 9.

	77 FS-ARCH-EMP-IDX	PIC XX.
	    88 IDX-OK		VALUE '00'.
	    88 IDX-NOENC	VALUE '23'.
	    88 IDX-EOF	VALUE '10'.
	    
	PROCEDURE DIVISION.

	CREAR-EMP-INDEXED.
		MOVE 0 TO WS-ACUM-REG.
	    PERFORM ABRIR-ARCHIVOS.

	    MOVE 11111111113 TO REG-EMP-IND-CUIT.

	    READ ARCH-EMP-IDX RECORD KEY IS REG-EMP-IND-CUIT.

	    DISPLAY REG-EMP-INDEXED.

	    PERFORM TERMINAR.

	ABRIR-ARCHIVOS.
	    OPEN INPUT ARCH-EMP-IDX.
	    IF IDX-OK
	       DISPLAY 'ARCHIVO IDX CREADO CON EXITO!'
	    ELSE
	       DISPLAY 'NO PUDO CREARSE ARCHIVO IDX ' FS-ARCH-EMP-IDX.
	
	TERMINAR.
	    CLOSE ARCH-EMP-IDX.
	    DISPLAY 'SE ESCREIBIERON ' WS-ACUM-REG '  REGISTROS INDEXADOS'.
	    DISPLAY 'INGRESE UN NRO PARA SALIR ' .
	    ACCEPT WS-LETRA.
	    STOP RUN.
