	IDENTIFICATION DIVISION.
	PROGRAM-ID. CreaEmpresas.
	AUTHOR. Fede.

	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	    SELECT EMPRESAS ASSIGN TO DISK 'EMPRESAS'
			ORGANIZATION IS LINE SEQUENTIAL
			FILE STATUS IS FS-EMPRESAS.

	    SELECT PRINT ASSIGN TO DISPLAY.

	DATA DIVISION.
	FILE SECTION.
	FD EMPRESAS LABEL RECORD IS STANDARD.

	01 REG-EMPRESA.
	   03 EMP-EMPRESA		PIC 9(3).
	   03 EMP-RAZON			PIC X(25).
	   03 EMP-DIRE			PIC X(20).
	   03 EMP-TEL			PIC X(20).
	   03 EMP-CUIT			PIC 9(11).
	
	WORKING-STORAGE SECTION.

	77 FS-EMPRESAS	PIC XX.
	    88 OK	VALUE '00'.
	    88 NOENC	VALUE '23'.
	    88 EOF	VALUE '10'.

	01 WS-CARGAR-EMPRESA PIC X.

	01 WS-EMPRESA		        PIC 9(3).
	01 WS-RAZON			PIC X(25).
	01 WS-DIRE			PIC X(20).
	01 WS-TEL			PIC X(20).
	01 WS-CUIT			PIC 9(11).

	01 LINEA-DIVISORIA.
	    03 FILLER PIC X(80) VALUE ALL '_'.

	PROCEDURE DIVISION.
	CREAR-EMPRESAS.
			PERFORM INICIAR.	
			PERFORM CARGA-EMPRESAS UNTIL WS-CARGAR-EMPRESA EQUAL '0'.				
			PERFORM FINALIZAR.

	INICIAR.				
			OPEN OUTPUT EMPRESAS.
			IF OK
		       DISPLAY 'ARCHIVO CREADO CON EXITO!'
		   ELSE
	      	 DISPLAY 'NO PUDO CREARSE ARCHIVO ' FS-EMPRESAS.

	CARGA-EMPRESAS.
			DISPLAY '¿DESEA INGRESAR UNA EMPRESAS MAS? PRESIONE 0 PARA SALIR, CUALQUIER TECLA PARA CONTINUAR'.
			ACCEPT WS-CARGAR-EMPRESA.				
			IF WS-CARGAR-EMPRESA NOT EQUAL '0'
				PERFORM CARGAR-EMPRESA.			 
			
	CARGAR-EMPRESA.
			DISPLAY 'INGRESE UN CODIGO DE EMPRESA 9(3)'.
			ACCEPT  WS-EMPRESA.
			MOVE WS-EMPRESA TO EMP-EMPRESA.

			DISPLAY 'INGRESE RAZON SOCIAL X(25)'.
			ACCEPT  WS-RAZON.
			MOVE WS-RAZON TO EMP-RAZON.
			
			DISPLAY 'INGRESE DIRECCION X(20)'.
			ACCEPT  WS-DIRE.
			MOVE WS-DIRE TO EMP-DIRE.
	
			DISPLAY 'INGRESE TELEFONO X(20)'.
			ACCEPT  WS-TEL.
			MOVE WS-TEL TO EMP-TEL.
	
			DISPLAY 'INGRESE CUIT 9(11)'.
			ACCEPT  WS-CUIT.
			MOVE WS-CUIT TO EMP-CUIT.
	

		   WRITE REG-EMPRESA.
			IF OK
		       DISPLAY 'GRABO OK'
		   ELSE
	      	 DISPLAY 'ERROR DE ESCRITURA ' FS-EMPRESAS.
		   DISPLAY LINEA-DIVISORIA.

	FINALIZAR.
			CLOSE EMPRESAS.
	    	STOP RUN.
