	IDENTIFICATION DIVISION.
	PROGRAM-ID. CreaArchivoReserva1.
	AUTHOR. Fede.

	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	    SELECT RESERVAS1 ASSIGN TO DISK 'CATEGORIAS'
			ORGANIZATION IS LINE SEQUENTIAL
			FILE STATUS IS FS-RESERVAS1.


	    SELECT PRINT ASSIGN TO DISPLAY. 

	DATA DIVISION.
	FILE SECTION.
	FD RESERVAS1 LABEL RECORD IS STANDARD.

	01 REG-RES1.
	   03 CAT-SRT		PIC x(2).
	   03 CAT-DESC		PIC x(20).
	   03 CAT-TARIFA        PIC 9(5)V99.

	WORKING-STORAGE SECTION.

	77 FS-RESERVAS1	PIC XX.
	    88 OK	VALUE '00'.
	    88 NOENC	VALUE '23'.
	    88 EOF	VALUE '10'.

	01 WS-CARGAR-RESERVA PIC X.
	
	01 WS-SRT		PIC x(2).
	01 WS-DESC		PIC x(20).
	01 WS-TARIFA         	PIC 9(5)V99.

	01 LINEA-DIVISORIA.
	    03 FILLER PIC X(80) VALUE ALL '_'.

	PROCEDURE DIVISION.
	CREAR-RESERVAS1.
			PERFORM INICIAR.	
			PERFORM CARGA-RESERVAS1 UNTIL WS-CARGAR-RESERVA EQUAL '0'.				
			PERFORM FINALIZAR.

	INICIAR.				
			OPEN OUTPUT RESERVAS1.
			IF OK
		       DISPLAY 'ARCHIVO CREADO CON EXITO!'
		   ELSE
	      	 DISPLAY 'NO PUDO CREARSE ARCHIVO ' FS-RESERVAS1.

	CARGA-RESERVAS1.
			DISPLAY '¿DESEA INGRESAR UNA CATEGORIA? PRESIONE 0 PARA SALIR, CUALQUIER TECLA PARA CONTINUAR'.
			ACCEPT WS-CARGAR-RESERVA.				
			IF WS-CARGAR-RESERVA NOT EQUAL '0'
				PERFORM CARGAR-RESERVA.			 
			
	CARGAR-RESERVA.
			DISPLAY 'INGRESE COD SEÑORITY PROGRAMADOR x(2)'.
			ACCEPT  WS-SRT.
			MOVE WS-SRT TO CAT-SRT.


			DISPLAY 'INGRESE DESCRIPCION SEÑORITY PROGRAMADOR x(25)'.
			ACCEPT  WS-DESC.
			MOVE WS-DESC TO CAT-DESC.


			DISPLAY 'INGRESE TARIFA SEÑORITY PROGRAMADOR 9(5)V99'.
			ACCEPT  WS-TARIFA.
			MOVE WS-TARIFA TO CAT-TARIFA.
			
		   WRITE REG-RES1.
			IF OK
		       DISPLAY 'GRABO OK'
		   ELSE
	      	 DISPLAY 'ERROR DE ESCRITURA ' FS-RESERVAS1.
		   DISPLAY LINEA-DIVISORIA.

	FINALIZAR.
			CLOSE RESERVAS1.
	    	STOP RUN.
