	IDENTIFICATION DIVISION.
	PROGRAM-ID. CreaNov1.
	AUTHOR. Fede.

	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	    SELECT NOV ASSIGN TO DISK 'NOV1'
			ORGANIZATION IS LINE SEQUENTIAL
			FILE STATUS IS FS-NOV.


	    SELECT PRINT ASSIGN TO DISPLAY. 

	DATA DIVISION.
	FILE SECTION.
	FD NOV LABEL RECORD IS STANDARD.

	01 REG-NOV.
	   03 NOV-NUMERO	PIC x(5).
	   03 NOV-FECHA		PIC 9(8).
	   03 NOV-EMPRESA       PIC 9(3).
	   03 NOV-TAREA		PIC x(4).
	   03 NOV-HORAS		PIC 9(2)V99.

	WORKING-STORAGE SECTION.

	77 FS-NOV	PIC XX.
	    88 OK	VALUE '00'.
	    88 NOENC	VALUE '23'.
	    88 EOF	VALUE '10'.

	01 WS-CARGAR-NOV PIC X.
	
	01 WS-NUMERO		PIC x(5).
	01 WS-FECHA		PIC 9(8).
	01 WS-EMPRESA       	PIC 9(3).
	01 WS-TAREA		PIC x(4).
	01 WS-HORAS		PIC 9(2)V99.
	

	01 LINEA-DIVISORIA.
	    03 FILLER PIC X(80) VALUE ALL '_'.

	PROCEDURE DIVISION.
	CREAR-RESERVAS1.
			PERFORM INICIAR.	
			PERFORM CARGA-NOV UNTIL WS-CARGAR-NOV EQUAL '0'.				
			PERFORM FINALIZAR.

	INICIAR.				
			OPEN OUTPUT NOV.
			IF OK
		       DISPLAY 'ARCHIVO CREADO CON EXITO!'
		   ELSE
	      	 DISPLAY 'NO PUDO CREARSE ARCHIVO ' FS-NOV.

	CARGA-NOV.
			DISPLAY '¿DESEA INGRESAR UNA NOV MAS? PRESIONE 0 PARA SALIR, CUALQUIER TECLA PARA CONTINUAR'.
			ACCEPT WS-CARGAR-NOV.				
			IF WS-CARGAR-NOV NOT EQUAL '0'
				PERFORM CARGAR-NOV.			 
			
	CARGAR-NOV.
			DISPLAY 'INGRESE NRO PROGRAMADOR x(5)'.
			ACCEPT  WS-NUMERO.
			MOVE WS-NUMERO TO NOV-NUMERO.


			DISPLAY 'INGRESE FECHA 9(8)'.
			ACCEPT  WS-FECHA.
			MOVE WS-FECHA TO NOV-FECHA.


			DISPLAY 'INGRESE EMPRESA'.
			ACCEPT  WS-EMPRESA.
			MOVE WS-EMPRESA TO NOV-EMPRESA.

			DISPLAY 'INGRESE TAREA x(4)'.
			ACCEPT  WS-TAREA.
			MOVE WS-TAREA TO NOV-TAREA.


			DISPLAY 'INGRESE HORAS 9(2)V99'.
			ACCEPT  WS-HORAS.
			MOVE WS-HORAS TO NOV-HORAS.
			
		   WRITE REG-NOV.
			IF OK
		       DISPLAY 'GRABO OK'
		   ELSE
	      	 DISPLAY 'ERROR DE ESCRITURA ' FS-NOV.
		   DISPLAY LINEA-DIVISORIA.

	FINALIZAR.
			CLOSE NOV.
	    	STOP RUN.
