	IDENTIFICATION DIVISION.
	PROGRAM-ID. CreaArchivoReserva1.
	AUTHOR. Fede.

	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	    SELECT RESERVAS1 ASSIGN TO DISK 'ESTADIAS'
			ORGANIZATION IS LINE SEQUENTIAL
			FILE STATUS IS FS-RESERVAS1.

	    SELECT PRINT ASSIGN TO PRINTER.

	DATA DIVISION.
	FILE SECTION.
	FD RESERVAS1 LABEL RECORD IS STANDARD.

	01 REG-RES1.
	   03 COD-RES		PIC 9(6).
	   03 DIGITO		PIC 9.
	   03 FECHA-DES 	PIC X(10).
	   03 FECHA-HAS 	PIC X(10).
		03 CATEG-HAB   PIC 9(04).
		03 IMPORTE		PIC S9(06)V99.

	WORKING-STORAGE SECTION.

	77 FS-RESERVAS1	PIC XX.
	    88 OK	VALUE '00'.
	    88 NOENC	VALUE '23'.
	    88 EOF	VALUE '10'.

	01 WS-CARGAR-RESERVA PIC X.

	01 WS-COD-RES		PIC 9(6).
	01 WS-DIGITO		PIC 9.
	01 WS-FECHA-DES 	PIC X(10).
	01 WS-FECHA-HAS 	PIC X(10).
	01 WS-CATEG-HAB   PIC 9(04).
	01 WS-IMPORTE		PIC S9(06)V99.

	01 LINEA-DIVISORIA.
	    03 FILLER PIC X(80) VALUE ALL '_'.

	PROCEDURE DIVISION.
	CREAR-RESERVAS1.
			PERFORM INICIAR.	
			PERFORM CARGA-RESERVAS1 UNTIL WS-CARGAR-RESERVA EQUAL '0'.				
			PERFORM FINALIZAR.

	INICIAR.				
			OPEN OUTPUT RESERVAS1.
			IF OK
		       DISPLAY 'ARCHIVO CREADO CON EXITO!'
		   ELSE
	      	 DISPLAY 'NO PUDO CREARSE ARCHIVO ' FS-RESERVAS1.

	CARGA-RESERVAS1.
			DISPLAY '¿DESEA INGRESAR UNA ESTADIA? PRESIONE 0 PARA SALIR, CUALQUIER TECLA PARA CONTINUAR'.
			ACCEPT WS-CARGAR-RESERVA.				
			IF WS-CARGAR-RESERVA NOT EQUAL '0'
				PERFORM CARGAR-RESERVA.			 
			
	CARGAR-RESERVA.
			DISPLAY 'INGRESE CODIGO DE ESTADIA'.
			ACCEPT  WS-COD-RES.
			MOVE WS-COD-RES TO COD-RES.

			DISPLAY 'INGRESE DIGITO DE ESTADIA'.
			ACCEPT  WS-DIGITO.
			MOVE WS-DIGITO TO DIGITO.
			
			DISPLAY 'INGRESE FECHA DESDE'.
			ACCEPT  WS-FECHA-DES.
			MOVE WS-FECHA-DES TO FECHA-DES.

			DISPLAY 'INGRESE FECHA HASTA'.
			ACCEPT  WS-FECHA-HAS.
			MOVE WS-FECHA-HAS TO FECHA-HAS.

			DISPLAY 'INGRESE CATEGORIA DE LA HABITACION'.
			ACCEPT  WS-CATEG-HAB.
			MOVE WS-CATEG-HAB TO CATEG-HAB.

			DISPLAY 'INGRESE NOMBRE IMPORTE'.
			ACCEPT  WS-IMPORTE.
			MOVE WS-IMPORTE TO IMPORTE.

		   WRITE REG-RES1.
			IF OK
		       DISPLAY 'GRABO OK'
		   ELSE
	      	 DISPLAY 'ERROR DE ESCRITURA ' FS-RESERVAS1.
		   DISPLAY LINEA-DIVISORIA.

	FINALIZAR.
			CLOSE RESERVAS1.
	    	STOP RUN.
