	IDENTIFICATION DIVISION.
	PROGRAM-ID. CreaConsultores.
	AUTHOR. Fede.

	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SPECIAL-NAMES.
		DECIMAL-POINT IS COMMA.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	    SELECT CONSULTORES ASSIGN TO DISK 'CONSULTORES'
			ORGANIZATION IS LINE SEQUENTIAL
			FILE STATUS IS FS-CONSULTORES.

	    SELECT PRINT ASSIGN TO DISPLAY.

	DATA DIVISION.
	FILE SECTION.
	FD CONSULTORES LABEL RECORD IS STANDARD.

	01 REG-CONSULTORES.
	   03 CONS-NUMERO		PIC X(5).
	   03 CONS-DNI			PIC 9(8).
	   03 CONS-SRT			PIC X(2).
	   03 CONS-NOMBRE		PIC X(25).
	   03 CONS-DIRE			PIC X(20).
	   03 CONS-TEL			PIC X(20).
	
	WORKING-STORAGE SECTION.

	77 FS-CONSULTORES	PIC XX.
	    88 OK	VALUE '00'.
	    88 NOENC	VALUE '23'.
	    88 EOF	VALUE '10'.

	01 WS-CARGAR-CONSULTOR PIC X.

	01 WS-NUMERO			PIC X(5).
	01 WS-DNI			PIC 9(8).
	01 WS-SRT			PIC X(2).
	01 WS-NOMBRE			PIC X(25).
	01 WS-DIRE			PIC X(20).
	01 WS-TEL			PIC X(20).

	01 LINEA-DIVISORIA.
	    03 FILLER PIC X(80) VALUE ALL '_'.

	PROCEDURE DIVISION.
	CREAR-CONSULTORES.
			PERFORM INICIAR.	
			PERFORM CARGA-CONSULTORES UNTIL WS-CARGAR-CONSULTOR EQUAL '0'.				
			PERFORM FINALIZAR.

	INICIAR.				
			OPEN OUTPUT CONSULTORES.
			IF OK
		       DISPLAY 'ARCHIVO CREADO CON EXITO!'
		   ELSE
	      	 DISPLAY 'NO PUDO CREARSE ARCHIVO ' FS-CONSULTORES.

	CARGA-CONSULTORES.
			DISPLAY '¿DESEA INGRESAR UN CONSULTOR MAS? PRESIONE 0 PARA SALIR, CUALQUIER TECLA PARA CONTINUAR'.
			ACCEPT WS-CARGAR-CONSULTOR.				
			IF WS-CARGAR-CONSULTOR NOT EQUAL '0'
				PERFORM CARGAR-CONSULTOR.			 
			
	CARGAR-CONSULTOR.
			DISPLAY 'INGRESE UN CODIGO DE CONSULTOR 9(5)'.
			ACCEPT  WS-NUMERO.
			MOVE WS-NUMERO TO CONS-NUMERO.

			DISPLAY 'INGRESE DNI  9(8)'.
			ACCEPT  WS-DNI.
			MOVE WS-DNI TO CONS-DNI.
			
			DISPLAY 'INGRESE SENIORITY X(2)'.
			ACCEPT  WS-SRT.
			MOVE WS-SRT TO CONS-SRT.
	
			DISPLAY 'INGRESE NOMBRE X(25)'.
			ACCEPT  WS-NOMBRE.
			MOVE WS-NOMBRE TO CONS-NOMBRE.
	
			DISPLAY 'INGRESE DIRECCION X(20)'.
			ACCEPT  WS-DIRE.
			MOVE WS-DIRE TO CONS-DIRE.
	
			DISPLAY 'INGRESE TELEFONO X(20)'.
			ACCEPT  WS-TEL.
			MOVE WS-TEL TO CONS-TEL.

		   WRITE REG-CONSULTORES.
			IF OK
		       DISPLAY 'GRABO OK'
		   ELSE
	      	 DISPLAY 'ERROR DE ESCRITURA ' FS-CONSULTORES.
		   DISPLAY LINEA-DIVISORIA.

	FINALIZAR.
			CLOSE CONSULTORES.
	    	STOP RUN.
